stm32duino/Arduino_Core_STM32/cores/arduino/stm32/uartF0.c
/** @addtogroup STM32F0xx_System_Private_FunctionPrototypes
  * @{
  */
static void uart_emul_timer_irq(timer_id_e timer_id) {g_uartEmul_config[UART1_EMUL_E].uart_rx_irqHandle();}
uart_id_e get_uart_id_from_handle(UART_HandleTypeDef *huart);

/**
  * @}
  */

/** @addtogroup STM32F0xx_System_Private_Functions
  * @{
  */

/**
  * @brief  This function returns the corresponding uart id function of the
  *         handle
  * @param  huart : one of the defined serial interface
  * @retval the UART id
  */
uart_id_e get_uart_id_from_handle(UART_HandleTypeDef *huart)
{
  uart_id_e uart_id = NB_UART_MANAGED;
  int i;
  for(i = 0; i<NB_UART_MANAGED; i++) {
    if(&g_UartHandle[i] == huart) {
      uart_id = i;
      break;
    }
  }
  return uart_id;
}



/**
  * @brief  UART MSP Initialization - perform IOs and clock init
  * @param  huart : one of the defined serial interface
  * @retval None
  */
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
  uart_id_e uart_id;

  uart_id = get_uart_id_from_handle(huart);
  if(NB_UART_MANAGED == uart_id) {
    return;
  }

  // Enable GPIO TX/RX clock
  g_uart_config[uart_id].gpio_tx_clock_init();
  g_uart_config[uart_id].gpio_rx_clock_init();

  // Enable USART clock
  g_uart_config[uart_id].uart_clock_init();


  //##-2- Configure peripheral GPIO ##########################################

  // UART TX GPIO pin configuration
  HAL_GPIO_Init(g_uart_config[uart_id].tx_port, &g_uart_config[uart_id].tx_pin);

  // UART RX GPIO pin configuration
  HAL_GPIO_Init(g_uart_config[uart_id].rx_port, &g_uart_config[uart_id].rx_pin);

  HAL_NVIC_SetPriority(g_uart_config[uart_id].irqtype, 0, 1);
  HAL_NVIC_EnableIRQ(g_uart_config[uart_id].irqtype);
}

/**
  * @brief  UART MSP DeInitialization - perform IOs and clock deinit
  * @param  huart : one of the defined serial interface
  * @retval None
  */
void HAL_UART_MspDeInit(UART_HandleTypeDef *huart)
{
  uart_id_e uart_id;

  uart_id = get_uart_id_from_handle(huart);
  if(NB_UART_MANAGED == uart_id) {
    return;
  }

  g_uart_config[uart_id].uart_force_reset();
  g_uart_config[uart_id].uart_release_reset();

  HAL_GPIO_DeInit(g_uart_config[uart_id].tx_port, g_uart_config[uart_id].tx_pin.Pin);
  HAL_GPIO_DeInit(g_uart_config[uart_id].rx_port, g_uart_config[uart_id].rx_pin.Pin);
}

/**
  * @brief  Function called to initialize the uart interface
  * @param  serial_id : one of the defined serial interface
  * @param  baudRate : baudrate to apply to the uart
  * @retval None
  */
void uart_init(uart_id_e uart_id, uint32_t baudRate)
{
  if(uart_id>=NB_UART_MANAGED) {
    return;
  }

  g_UartHandle[uart_id].Instance        = g_uart_config[uart_id].usart_typedef;
  g_UartHandle[uart_id].Init.BaudRate   = baudRate;
  g_UartHandle[uart_id].Init.StopBits   = UART_STOPBITS_1;

  g_UartHandle[uart_id].Init.WordLength = UART_WORDLENGTH_8B;
  g_UartHandle[uart_id].Init.Parity     = UART_PARITY_NONE;
  g_UartHandle[uart_id].Init.Mode       = UART_MODE_TX_RX;
  g_UartHandle[uart_id].Init.HwFlowCtl  = UART_HWCONTROL_NONE;

  // g_UartHandle[uart_id].Init.OverSampling = UART_OVERSAMPLING_16;
  // g_UartHandle[uart_id].Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;

  if(HAL_UART_Init(&g_UartHandle[uart_id])!= HAL_OK) {
    return;
  }

#ifdef UART_OPTIMIZED
  UART_MASK_COMPUTATION(&g_UartHandle[uart_id]);

  /* Enable the UART Data Register not empty Interrupt */
  __HAL_UART_ENABLE_IT(&g_UartHandle[uart_id], UART_IT_RXNE);
#else
  if(HAL_UART_Receive_IT(&g_UartHandle[uart_id], g_rx_data, 1)!= HAL_OK) {
    return;
  }
#endif
}

/**
  * @brief  Function called to deinitialize the uart interface
  * @param  serial_id : one of the defined serial interface
  * @retval None
  */
void uart_deinit(uart_id_e uart_id)
{
  HAL_UART_DeInit(&g_UartHandle[uart_id]);
}

/**
  * @brief  Function returns the amount of data available
  * @param  serial_id : one of the defined serial interface
  * @retval The number of serial data available - int
  */
int uart_available(uart_id_e uart_id)
{
  return g_uart_config[uart_id].data_available;
}

/**
  * @brief  Return the first element of the rx buffer
  * @param  serial_id : one of the defined serial interface
  * @retval The first byte of incoming serial data available (or -1 if no data is available) - int
  */
int8_t uart_read(uart_id_e uart_id)
{
  int8_t data = -1;

  if(g_uart_config[uart_id].data_available > 0) {

    data = g_uart_config[uart_id].rxpData[g_uart_config[uart_id].begin++];

    if(g_uart_config[uart_id].begin >= UART_RCV_SIZE) {
      g_uart_config[uart_id].begin = 0;
    }

    g_uart_config[uart_id].data_available--;
  }

  return data;
}

/**
  * @brief  Return the first element of the rx buffer without removing it from
  *         the buffer
  * @param  serial_id : one of the defined serial interface
  * @retval The first byte of incoming serial data available (or -1 if no data is available) - int
  */
int8_t uart_peek(uart_id_e uart_id)
{
  int8_t data = -1;

  if(g_uart_config[uart_id].data_available > 0) {
    data = g_uart_config[uart_id].rxpData[g_uart_config[uart_id].begin];
  }

  return data;
}

/**
  * @brief  Flush the content of the RX buffer
  * @param  serial_id : one of the defined serial interface
  * @retval None
  */
void uart_flush(uart_id_e uart_id)
{
  g_uart_config[uart_id].data_available = 0;
  g_uart_config[uart_id].end = 0;
  g_uart_config[uart_id].begin = 0;
}

/**
  * @brief  write the data on the uart
  * @param  serial_id : one of the defined serial interface
  * @param  data : byte to write
  * @retval The number of bytes written
  */
size_t uart_write(uart_id_e uart_id, uint8_t data)
{
  HAL_UART_Transmit(&g_UartHandle[uart_id], &data, 1, 5000);
  return 1;
}

/**
  * @brief  error callback from UART
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  uart_id_e uart_id = get_uart_id_from_handle(huart);
  if(NB_UART_MANAGED == uart_id) {
    return;
  }

  uart_deinit(uart_id);
  uart_init(uart_id, g_UartHandle[uart_id].Init.BaudRate);
}

/**
  * @brief  Read receive byte from uart
  * @param  UartHandle pointer on the uart reference
  * @param  byte byte to read
  * @retval None
  */
static void uart_getc(uart_id_e uart_id, uint8_t byte)
{
  if((NB_UART_MANAGED == uart_id) ||
      (g_uart_config[uart_id].data_available >= UART_RCV_SIZE)) {
    return;
  }
  g_uart_config[uart_id].rxpData[g_uart_config[uart_id].end++] = byte;
  if(g_uart_config[uart_id].end >= UART_RCV_SIZE) {
    g_uart_config[uart_id].end = 0;
  }
  g_uart_config[uart_id].data_available++;
}

/**
  * @brief  Rx Transfer completed callback
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
  uart_id_e uart_id = get_uart_id_from_handle(huart);

  HAL_UART_Receive_IT(&g_UartHandle[uart_id], g_rx_data, 1);

  uart_getc(uart_id, g_rx_data[0]);
}

/**
  * @brief UART waking up
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void HAL_UARTEx_WakeupCallback(UART_HandleTypeDef *huart)
{
}

/**
  * @brief  USART 1 IRQ handler
  * @param  None
  * @retval None
  */
void USART1_IRQHandler(void)
{
#ifdef UART_OPTIMIZED
  /* UART in mode Receiver ---------------------------------------------------*/
  if((__HAL_UART_GET_IT(&g_UartHandle[USART1_E], UART_IT_RXNE) != RESET) &&
     (__HAL_UART_GET_IT_SOURCE(&g_UartHandle[USART1_E], UART_IT_RXNE) != RESET))
  {
    uart_getc(USART1_E, (uint8_t)(g_UartHandle[USART1_E].Instance->RDR &
                                                 (uint8_t)g_UartHandle[USART1_E].Mask));

    /* Enable the UART Data Register not empty Interrupt */
    __HAL_UART_ENABLE_IT(&g_UartHandle[USART1_E], UART_IT_RXNE);

    /* Clear RXNE interrupt flag */
    __HAL_UART_SEND_REQ(&g_UartHandle[USART1_E], UART_RXDATA_FLUSH_REQUEST);

