stm32duino/Arduino_Core_STM32/cores/arduino/stm32/uartF0.c
  return data;
}

/**
  * @brief  Flush the content of the RX buffer
  * @param  serial_id : one of the defined serial interface
  * @retval None
  */
void uart_emul_flush(uart_emul_id_e uart_id)
{
  if(uart_id>=NB_UART_EMUL_MANAGED) {
    return;
  }

  g_uartEmul_config[uart_id].data_available = 0;
  g_uartEmul_config[uart_id].end = 0;
  g_uartEmul_config[uart_id].begin = 0;
}

/**
  * @brief  Read receive byte from uart
  * @param  UartHandle : pointer on the uart reference
  * @param  byte : byte to read
  * @retval None
  */
static void uart_emul_getc(uart_emul_id_e uart_id, uint8_t byte)
{
  if((uart_id >= NB_UART_EMUL_MANAGED) ||
      (g_uartEmul_config[uart_id].data_available >= UART_RCV_SIZE)) {
    return;
  }

  g_uartEmul_config[uart_id].rxpData[g_uartEmul_config[uart_id].end++] = byte;
  if(g_uartEmul_config[uart_id].end >= UART_RCV_SIZE) {
    g_uartEmul_config[uart_id].end = 0;
  }
  g_uartEmul_config[uart_id].data_available++;
}

/**
  * @brief
  * @param  irq : pointer to function to call
  * @retval None
  */
void uart_emul_attached_handler(void (*irqHandle)(void))
{
  TimerHandleInit(TIM14_E, EMUL_TIMER_PERIOD - 1, (uint16_t)(HAL_RCC_GetHCLKFreq() / 1000) - 1); //50ms
  g_uartEmul_config[UART1_EMUL_E].uart_rx_irqHandle = irqHandle;
  attachIntHandle(TIM14_E, uart_emul_timer_irq);
}

/**
  * @brief  Initializes the UART Emulation Transfer Complete.
  * @param  huart: UART Emulation Handle
  * @retval None
  */
void HAL_UART_Emul_RxCpltCallback(UART_Emul_HandleTypeDef *huart)
{
  uart_emul_getc(UART1_EMUL_E, *huart->pRxBuffPtr);
  HAL_UART_Emul_Receive(&g_UartEmulHandle[UART1_EMUL_E], g_rx_data, 1);

  if(g_uartEmul_config[UART1_EMUL_E].uart_rx_irqHandle != NULL) {
    if(uart_emul_available(UART1_EMUL_E) < (UART_RCV_SIZE / 2))
      setTimerCounter(TIM14_E, 0);
    else if(uart_emul_available(UART1_EMUL_E) < (UART_RCV_SIZE/4*3))
      setTimerCounter(TIM14_E, EMUL_TIMER_PERIOD - 1);
    else
      /*setTimerCounter(TIM14_E, EMUL_TIMER_PERIOD - 1);*/g_uartEmul_config[UART1_EMUL_E].uart_rx_irqHandle();
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif
#endif
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
